Repository: DmRafaule/DjangoDeploymentTest
Catalog: Website/Frontend/locale/*/LC_MESSAGES/django.po
Languages: be

source: Форма редактирования объекта
be: Форма рэдагавання аб'екта

source: Сохранить
be: Захаваць

source: Отмена
be: Адмена

source: Удалить
be: Выдаліць

source: Изменить
be: Змяніць

source: Скачать
be: Спампаваць

source: Форма создания нового объекта
be: Форма стварэння новага аб'екта

source: Создать
be: Стварыць

source: Предыдущая
be: Папярэдняя

source: Следующая
be: Наступная

source: Опубликованно
be: Апублікавана

source: Обновленно
be: Абноўлена

source: Форма отправки почты
be: Форма адпраўкі пошты

source: Отправить
be: Адправіць

source: Джанго сайт для теста деплоя
be: Джанго сайт для тэсту дэплоя

source: Все права защищены
be: Усе правы абаронены

source: <p>Сделано <b>Тимом Вебмастером</b>, для <b>Тимы Вебмастера</b></p>
be: <p>Зроблена <b>Цімам Вэбмайстрам</b>, для <b>Цімы Вэбмайстра</b></p>

source: Сайт для теста процесса деплоя на серверах
be: Сайт для тэсту працэсу дэплою на серверах

source: Данный сайт был разработан лишь с одной целью. С целью проверки возможности деплоя на различных серверах и прочих. Плюс возможность потренироваться в этом деле перед тем как заливать свой собственный сайт.
be: Дадзены сайт быў распрацаваны толькі з адной мэтай. З мэтай праверкімагчымасці дэплою на розных серверах і іншых. Плюс магчымасць патрэніравацца ў гэтай справе перад тым як заліваць свой уласны сайт.

source: Поддерживаеммые тесты на данный момент:
be: Тэсты, якія падтрымліваюцца, на дадзены момант:

source: Работа с почтой. (Отправление писем на указанный почтовый адресс)
be: Праца з поштай. (Адпраўленне лістоў на ўказаны паштовы адрас)

source: Работа с базой данных. (Добавление, Изменение, Удаление из БД. Плюс сортировка записей в БД)
be: Праца з базай дадзеных. (Даданне, Змяненне, Выдаленне з БД. Плюс сартаванне запісаў у БД)

source: Работа с медиа файлами. (Загрузка их на сервер и возможность их получить)
be: Праца з медыя файламі. (Загрузка іх на сервер і магчымасць іх атрымаць)

source: Работа со статическими файлами. (Их доступность)
be: Праца са статычнымі файламі. (Іх даступнасць)

source: Работа тестов на сервере, их покрытие проектом
be: Праца тэстаў на серверы, іх пакрыццё праектам

source: Работа с переводами. (Переводы шаблонов(<b>HTML</b>), переводы в скриптах(<b>JS</b>), переводы на сервере(<b>Python</b>))
be: Праца з перакладамі. (Пераклады шаблонаў(<b>HTML</b>), пераклады ў скрыптах(<b>JS</b>), пераклады на серверы(<b>Python</b>))

source: Джанго сайт для теста деплоя. Тест работы базы данных
be: Джанга сайт для тэсту дэплою. Тэст працы базы дадзеных

source: Тестирование работы с базой данных
be: Тэставанне працы з базай дадзеных

source: Данная страница предоставляет возможность проверить перенесена ли база данных корректно. Плюс, возможны ли такие базовые операции с БД как добавление, удаление изменение и пагинирование. Для тестирования были созданны две модели Tag и Post
be: Дадзеная старонка дае магчымасць праверыць ці перанесена база дадзеных карэктна. Плюс, ці магчымыя такія базавыя аперацыі з БД як даданне, выдаленне змена і пагінаванне. Для тэставання былі створаны дзве мадэлі Tag і Post

source: Джанго сайт для теста деплоя. Тест работы с почтой
be: Джанга сайт для тэсту дэплою. Тэст працы з поштай

source: Тестирование работы с почтой
be: Тэставанне працы з поштай

source: На этой странице ты можешь написать и отправить письмо на любой почтовый адрес. С тем условием, что настройка почты на сервере была завершена успешна.
be: На гэтай старонцы ты можаш напісаць і адправіць ліст на любыпаштовы адрас. З той умовай, што настройка пошты на серверы была завершана паспяховая.

source: Джанго сайт для теста деплоя. Тест работы медиа файлов
be: Джанга сайт для тэсту дэплою. Тэст працы медыя файлаў

source: Тестирование работы медиа файлов
be: Тэставанне працы медыя файлаў

source: На этой странице ты сможешь загрузить на сервер новый файл (проверка медиа), после чего скачать его обратно
be: На гэтай старонцы ты зможаш загрузіць на сервер новы файл (праверка медыя), пасля чаго спампаваць яго назад

source: Получить доступные файлы
be: Атрымаць даступныя файлы

source: Джанго сайт для теста деплоя. Тест работы статических файлов
be: Джанга сайт для тэсту дэплою. Тэст працы статычных файлаў

source: Тестирование работы статических файлов
be: Тэставанне працы статычных файлаў

source: Эта страница должа будет загрузить некоторые статические файлы (изображения), с сервера. Если ты их получил значит настройки сервера с работой со статикой успешны.
be: Гэтая старонка павінна будзе загрузіць некаторыя статычныя файлы (малюнкі), з сервера. Калі ты іх атрымаў значыць налады сервера з працай са статыкай паспяховыя.

source: Джанго сайт для теста деплоя. Тест работы тестирования сервера в эксплуатации
be: Джанго сайт для тэсту дэплою. Тэст працы тэставання сервера ў эксплуатацыі

source: Тестирование работы тестирования на производственном сервере
be: Тэставанне працы тэставання на вытворчым серверы

source: Джанго сайт для теста деплоя. Тест работы переводов
be: Джанга сайт для тэсту дэплою. Тэст працы перакладаў

source: Тестирование переводов
be: Тэсціраванне перакладаў

source: Здесь будет представлен некоторый текст, который должен быть доступен на различных языках. Так же под перевод должны попасть любые строчки написанные на сервере или в JS коде.
be: Тут будзе прадстаўлены некаторы тэкст, які павінен быцьдаступны на розных мовах. Гэтак жа пад пераклад павінны патрапіць любыя радкі напісаныя на серверы або ў JS кодзе.

source: Это строчки с сервера
be: Гэта радкі з сервера

source: Получить строки с сервера
be: Атрымаць радкі з сервера

source: Это строчки из JS кода
be: Гэта радкі з JS кода

source: Получить строки JS скриптов
be: Атрымаць радкі JS скрыптоў

source: Это сообщение было отправленно с тестового сайта по деплою
be: Гэтае паведамленне было адпраўлена з тэставага сайта па дэплоі.

source: Успешно отправил письмо
be: Паспяхова адправіў ліст

source: Не смог отправить письмо
be: Не змог адправіць ліст

source: Это сообщение с сервера
be: Гэта паведамленне з сервера
